######## 使用while循环计算1~100的累积和（包含1和100）。
# i = 1
#
# sum = 0
#
# while i <= 100:
#     sum = sum + i
#     i += 1
#
# print("1-100的累积和为%d" % sum)


######## 计算1~100之间偶数的累积和（包含1和100）
# i = 1
# sum = 0
# while i <= 100:
#     if i % 2 == 0:
#         sum = sum + i
#     i += 1
#
# print(sum)

######## 使用while循环计算5!（5的阶乘）。
#
# i = 1
# sum = 1
# while i <= 5:
#     sum = sum * i
#     i += 1
# print(sum)

######## 从键盘获取一个数字，然后计算它的阶乘，例如输入的是3，那么即计算3!(3!的意思就是3的阶乘)的结果，并输出

# num = int(input('请输入要计算的数字'))
# i = 1
# sum = 1
# while i <= num:
#     sum = sum * i
#     i += 1
# print(sum)


######## 使用while循环输出如下图形：
#
# *
# * *
# * * *
# * * * *
# * * * * *
#
# i = 1
# while i <= 5:
#     j = 1
#     while j <= i:
#         print("*",end=" ")
#         j += 1
#
#     print()
#     i += 1

######## 如何使用while嵌套循环输出如下图形：
# * * * * *
# * * * *
# * * *
# * *
# *

# i = 1
# while i <= 5:
#     j = 5
#     while j >= i:
#         print("*",end=(" "))
#         j -= 1
#     print()
#     i += 1

#########使用循环嵌套打印九九乘法表。

# 1*1=1
# 1*2=2  2*2=4
# 1*3=3  2*3=6  3*3=9
# 1*4=4  2*4=8  3*4=12  4*4=16

# i = 1
# while i <= 9:
#     j = 1
#     while j <= i:
#         print(i,"*",j,"=",i*j,end="   ")
#         j += 1
#
#     print()
#     i += 1

######### 设计“过7游戏”的程序, 打印出1-100之间除了含7和7的倍数之外的所有数字。

# i = 1
# while i <= 100:
#     i += 1
# for x in range(i):
#     if x % 10 != 7 and x % 7 != 0 and x // 10 != 7:
#         print(x)

########使用while，完成以下图形的输出

#     *
#    ***
#   *****
#  *******
# *********
#  *******
#   *****
#    ***
#     *

i = 1
while i <= 5:
    j = 1
    while j <= 5:
        print("*",end=(" "))
        j += 1

    print()

    i += 1
